# FamilyTypeSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyTypeSet Constructor
FamilyTypeSet Class See Also
---
Initializes a new instance of the FamilyTypeSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyTypeSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FamilyTypeSet()
```

# See Also
FamilyTypeSet Class
Autodesk.Revit.DB Namespace